Revit 2027 API
Units Methods
The Units type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFormatOptions |  Gets the default FormatOptions for a spec.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetModifiableSpecs |  Gets all specs for which the default FormatOptions can be modified.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsModifiableSpec |  Checks whether the default FormatOptions can be modified for a given spec.
SetFormatOptions |  Sets the default FormatOptions for a spec.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Units Class
Autodesk.Revit.DB Namespace